Проект выполнялся в команде из 2-х человек. Задание заключается в следующем: необходимо написать программу, которая полностью повторяла бы поведение стандартной программы языка С - printf (https://ru.wikipedia.org/wiki/Printf). Её особенности заключается в том, что она записывает в стандартный вывод неизвестное заранее число элементов разного типа.

Задание находится в файле subject_ft_printf.en.pdf

Запускать:
1) make
2) gcc main.c libftprintf.a (файл main.c можно менять для проверки)
3) ./a.out
